class Messages:
    hellp = """
` راهنما ` 
برای دریافت لیست دستورات ربات از این دستور استفاده کنید.

` بروزرسانی مدیران ` 
برای اپدیت کردن لیست مدیران یک گروه

 ` قفل `
بعد کلمه قفل نام چیزی که میخواهید قفل شود را ارسال کنید برای نمونه
!قفل لینک

` لیست قفل ها ` 
برای دریافت لیست قفل ها از این دستور استفاده کنید.

` بازکردن  ` 
بعد کلمه بازکردن نام چیزی که میخواهید قفل ان باز شود را ارسال کنید برای نمونه
بازکردن گیف

 ` بازکردن همه `
برای باز کردن تمام قفل ها از این دستور استفاده کنید.

` حذف تاریخچه ` 
برای حذف همه پیامم هایه گروه

` وضعیت ` 

برای دریافت وضعیت قفل های گروه از این دستور استفاده کنید.

 ` بن ` 
کسی که میخواهید بن بشه روی پیامش ریپلای کنید و کلمه !بن رو ارسال کنید
کاربر اخراج میشود

` ارتقا مدیر ` 
با این دستور یک کاربر را عضو ادین های ربات کنید. فقط مدیر اصلی گروه

` عزل مدیر ` 
برای حذف مدیر از لیست مدیران ربات فقط مدیر اصلی گروه
"""
    group_added = "گروه تنظیم شد.\nقفل های فعال لینک و منشن.\nدر حال دریافت مدیران ..."
    group_exists = "گروه از قبل تنظیم شده است.\nدر حال به روزرسانی مدیران ..."
    error_add_group = "گروه اضافه نشد لطفا به سازنده ربات پیام دهید"

    update_admins = "به روزرسانی مدیران با موفقیت انجام شد."

    group_status = "قفل های فعال گروه:\n"
    group_creator = "\nسازنده گروه"
    group_admins = "\nمدیران گروه"
    pleas_reply_on_message = "لطفا روی یک پیام ریپلاس کنید و بعد دستور را ارسال کنید"
    lock_list = "لیست قفل های ربات:"
    copy = "با زدن رویهر یک خودکار کپی میشوند"
    add_lock = "\n قفل {} \t باز کردن {}"
    lock = "قفل"
    active_lock = "قفل {} فعال شد."
    un_lock = "بازکردن"
    deactive_lock = "قفل {} غیر فعال شد."
    ban_user = "کاربر {} از گروه اخراج شد."
    cant_find_user = "کاربر یافت نشد"
    cant_ban_admin = "شما نمیتوانید ادمین های دیگر را اخراج کنید"
    join_messages = ["را اضافه کرد", "از طریق لینک به گروه افزوده شد", '1 عضو جدید به گروه افزوده شد.']
    left_messages = ["گروه را ترک کرد", "1 عضو از گروه حذف شد."]
    rubika_messages = join_messages + left_messages
    start_delete = "شروع پاکسازی ..."
    delete_message = "تعداد {} پیام پاک شدند"
    lock_not_found = "هیچ قفلی با این نام پیدا نشد"
    open_all_locks = "همه قفل ها باز شدند"
    send_link = "ارسال لینک"
    delete_user = "کاربر {} به علت ارسال {} از گروه حذف شد."
    delete_message_t = 'کاربر {} ارسال {} در گروه ممنوع است'
    bot = ['جونم سسکی من👿😈', 'بوسم نکنی جوابتو نمیدم🤤😋',
           'الان ازت خوشم نمیاد شب جمعه شاید اوکی شدیم🤣', 'اینجا زشته بچه ها میبینن بد آموزی داره بیا پی🤗', ]